pitlab/Kamera-OV9655-na-STM32F746G-DISCO/Core/Src/main.c
  /*Configure GPIO pins : TP3_Pin NC2_Pin */
  GPIO_InitStruct.Pin = TP3_Pin|NC2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /*Configure GPIO pin : DCMI_PWR_EN_Pin */
  GPIO_InitStruct.Pin = DCMI_PWR_EN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DCMI_PWR_EN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_INT_Pin */
  GPIO_InitStruct.Pin = LCD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ULPI_NXT_Pin */
  GPIO_InitStruct.Pin = ULPI_NXT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(ULPI_NXT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_D4_Pin ARDUINO_D2_Pin EXT_RST_Pin */
  GPIO_InitStruct.Pin = ARDUINO_D4_Pin|ARDUINO_D2_Pin|EXT_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
void vApplicationIdleHook( void )
{

}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_HOST */
  MX_USB_HOST_Init();

  /* init code for LWIP */
  MX_LWIP_Init();
  /* USER CODE BEGIN 5 */
  //const char* message = "Hello UDP message!\n\r";
  static uint8_t bufor_kamery[1280 * 1024 * 2] __attribute__((section(".BuforKamery")));
  static uint8_t bufor_okna[320 * 240 * 2] __attribute__((section(".BuforLCD1")));
  //static uint8_t bufor_ekranu[480 * 272 * 4] __attribute__((section(".BuforLCD0")));
  static uint8_t bufor_czarnobialy[320 * 240] __attribute__((section(".BuforKamery")));
  static uint8_t bufor_cbOut[320 * 240] __attribute__((section(".BuforKamery")));
  char chNapis[DLUGOSC_NAPISU];
  uint8_t chZrobione = 0;
  uint8_t n, chFilm = 0;
  TS_StateTypeDef touch;
  extern float fImag;
  uint8_t chWskWiersza = 0;
  uint8_t chTabPrzyciskow[8];
  //uint32_t nHistBit[16];

  uint32_t nCzas;

  struct etharp_entry {
  #if ARP_QUEUEING
    /** Pointer to queue of pending outgoing packets on this ARP entry. */
    struct etharp_q_entry *q;
  #else /* ARP_QUEUEING */
    /** Pointer to a single pending outgoing packet on this ARP entry. */
    struct pbuf *q;
  #endif /* ARP_QUEUEING */
    ip4_addr_t ipaddr;
    struct netif *netif;
    struct eth_addr ethaddr;
    u16_t ctime;
    u8_t state;
  };
  //extern struct etharp_entry arp_table[];
  extern struct netif gnetif;


#ifdef USE_SOCKET
  //Create the task to write to server
  osThreadDef(lwipWriteTask, WriteLWIPClientTask, osPriorityNormal, 0, 2048);
  lwipWriteTaskHandle = osThreadCreate(osThread(lwipWriteTask), NULL);

  //Create the task to read from server
  osThreadDef(lwipReadTask, ReadLWIPClientTask, osPriorityNormal, 0, 2048);
  lwipReadTaskHandle = osThreadCreate(osThread(lwipReadTask), NULL);
#endif


  osDelay(1000);

  //ip_addr_t PC_IPADDR;
  //IP_ADDR4(&PC_IPADDR, 192, 168, 1, 111);
  //struct pbuf* udp_buffer = NULL;
  //struct udp_pcb* my_udp = udp_new();
  //udp_connect(my_udp, &PC_IPADDR, 55151);

  //struct eth_addr adres_eth;
  //extern int etharp_get_entry(size_t i, ip4_addr_t **ipaddr, struct netif **netif, struct eth_addr **eth_ret);



  /* Infinite loop */
  for (;;) {
    osDelay(100);
    /* !! PBUF_RAM is critical for correct operation !! */
   /* udp_buffer = pbuf_alloc(PBUF_TRANSPORT, strlen(message), PBUF_RAM);

    if (udp_buffer != NULL) {
      memcpy(udp_buffer->payload, message, strlen(message));
      udp_send(my_udp, udp_buffer);
      pbuf_free(udp_buffer);
    }*/

    BSP_LED_Toggle(0);
    BSP_TS_GetState(&touch);

    BSP_LCD_SelectLayer(0);
    sprintf(chNapis, "X=%d, Y=%d  ", touch.touchX[0], touch.touchY[0]);
    BSP_LCD_DisplayStringAt(KLAW_POZ_X1, 220, (uint8_t*)chNapis, LEFT_MODE);
    sprintf(chNapis, "T=%d, W=%d  ", touch.touchDetected, touch.touchWeight[0]);
    BSP_LCD_DisplayStringAt(KLAW_POZ_X1, 240, (uint8_t*)chNapis, LEFT_MODE);

    if (!touch.touchDetected)
    {
    	chZrobione = 0;
    }


	WykryjNacisniecie(&touch, chTabPrzyciskow);	//wykryj naciśnięcie w obrębie zdefiniowanych przycisków

    //przycisk zrób zdjęcie
    if (chTabPrzyciskow[0] && !chZrobione)
    {
    	BSP_CAMERA_SnapshotStart(bufor_okna);
    	chZrobione = 1;
    	chRodzajWyswietlania = 0;
    }

    //przycisk rozpocznij/zakończ film
    if (chTabPrzyciskow[1] && !chZrobione)
	{
    	if (chFilm)
    	{
    		BSP_CAMERA_Suspend();
    		sprintf(chNapis, "Film>");
			chFilm = 0;
    	}
    	else
    	{
			BSP_CAMERA_ContinuousStart(bufor_okna);
			sprintf(chNapis, "Film|");
			chFilm = 1;
    	}

    	//zmień status przycisku Start/Stop Film
		BSP_LCD_SelectLayer(0);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_SetBackColor(LCD_COLOR_GREEN);
		BSP_LCD_DisplayStringAt(KLAW_POZ_X2+5, KLAW1_Y + NAPIS_OFFY, (uint8_t*)chNapis, LEFT_MODE);
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE);	//przywróć kolor tła
		chRodzajWyswietlania = 0;
    	chZrobione = 1;
	}

    //konwersja kolor -> C/B
    if (chTabPrzyciskow[2] && !chZrobione)
    {
    	//for (uint8_t x=0; x<16; x++)
    		//nHistBit[x] = 0;

    	chZdjecieGotowe = 0;
    	BSP_CAMERA_SnapshotStart(bufor_kamery);
    	do; while (!chZdjecieGotowe);
    	uint8_t pix1, pix2, pixCB, pixRB, pixG;
		for (uint32_t n=0; n<320*240; n++)
		{
			pix1 = bufor_kamery[2*n+0];		//B+G
			pix2 = bufor_kamery[2*n+1];		//G+R

			/*for (uint8_t x=0; x<8; x++)
			{
				nHistBit[x+0] += (pix1 >> x) & 0x01;
				nHistBit[x+8] += (pix2 >> x) & 0x01;
			}*/

			//bity czerwony i niebieski mają skalę 5-bitową (32), zielony 6-bitową (64).
			pixCB = (pix1 >> 3) + (pix2 & 0x1F) + ((pix1 & 0x07) << 3) + (pix2 >> 5);		//((R32 + B32) + G64)
			bufor_czarnobialy[n] = pixCB;

			pixRB = pixCB >> 2;	//składowe: czerwona i niebieska
			pixG  = pixCB >> 1;	//składowa zielona
			bufor_okna[2*n+0] = ((pixG & 0x07) << 5) + pixRB;
			bufor_okna[2*n+1] = (pixRB << 3) + (pixG >> 3);
		}
		chZrobione = 1;
		chRodzajWyswietlania = 0;

		/* osDelay(1);
		//rysuj histogram na  ekranie
		BSP_LCD_SelectLayer(1);
		BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
		uint16_t sHistVal;
		for (uint8_t x=0; x<16; x++)
		{
			sHistVal = (uint16_t)(nHistBit[x] >> 8);
			BSP_LCD_FillRect(x*20+2, 240-sHistVal, 16, sHistVal);
		}*/
    }

    //wykrywanie krawędzi
    if (chTabPrzyciskow[3] && !chZrobione)
    {
    	chZdjecieGotowe = 0;
		//BSP_CAMERA_SnapshotStart(bufor_kamery);
		//do; while (!chZdjecieGotowe);

    	DetekcjaKrawedziRoberts(bufor_czarnobialy, bufor_cbOut, 320, 240);
    	KonwersjaCB7doRGB565(bufor_cbOut, bufor_okna, 320*240);
		chZrobione = 1;
		chRodzajWyswietlania = 0;
    }

	//przycisk Monitor IP
	if (chTabPrzyciskow[4] && !chZrobione)
	{
		BSP_LCD_SelectLayer(1);
		BSP_LCD_Clear(LCD_COLOR_BLACK);
		chRodzajWyswietlania = TW_MONITOR;
		chZrobione = 1;
	}

	//przycisk fraktal
	if (chTabPrzyciskow[5] && !chZrobione)
	{
		InitFraktal(0);
		chRodzajWyswietlania = TW_JULIA;
		chZrobione = 1;
	}

	//cccc
	if (chTabPrzyciskow[6] && !chZrobione)
	{
		for (uint32_t n=0; n<320*240; n++)
		{
			bufor_okna[2*n+0] = 0x00;
			bufor_okna[2*n+1] = 0xF8;
		}
		//memcpy (bufor_okna, bufor_kamery, 320*240*2);
		chZrobione = 1;
		chRodzajWyswietlania = 0;
	}

	//dddd
	if (chTabPrzyciskow[7] && !chZrobione)
	{
		chZdjecieGotowe = 0;
		BSP_CAMERA_SnapshotStart(bufor_kamery);
		do; while (!chZdjecieGotowe);

		KonwersjaRGB565doCB7(bufor_kamery, bufor_okna, bufor_czarnobialy, 320*240);
		chZrobione = 1;
		chRodzajWyswietlania = 0;
	}

	//cykliczne wyświetlanie
	switch(chRodzajWyswietlania)
	{
	case TW_JULIA:
		nCzas = HAL_GetTick();
		GenerateJulia(320, 240, 160, 120, 135, (unsigned short *)bufor_okna);
		fImag -= 0.002;
		nCzas = MinalCzas(nCzas);

